jorgebucaran/fisher
jethrokuan/z
jorgebucaran/autopair.fish
rstacruz/fish-asdf
fischerling/plugin-wd
oh-my-fish/plugin-extract
vincentjames501/fish-kill-on-port
oakninja/makemefish
wfxr/forgit
pure-fish/pure
acomagu/fish-async-prompt
